In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('student.db')
conn

In [3]:
sql = """
 CREATE TABLE student
 ( 
 name text,
 no integer,
 addr text,
 gender text
 )
"""

c = conn.cursor()
c.execute("DROP TABLE IF EXISTS student")
c.execute(sql)
c.close()

In [27]:
sql = """
 INSERT INTO student VALUES
 (?, ?, ?, ?)
"""
c = conn.cursor() # 객체 생성
c.execute(sql, ('학생2', 2, '안양', 'female'))
data = [
 ('학생3', 3, '경기도', 'female'),
 ('학생4', 4, '춘천', 'female'),
 ('학생5', 5, '대구', 'male')
]
c.executemany(sql, data)
c.close()
conn.commit()

In [29]:
sql = 'select * from student1'
c = conn.cursor()
c.execute(sql)
# 하나의 데이터 확인
print( c.fetchone() )

('최종운', 100, 90, 80)

In [26]:
for s in c.fetchmany(10):
 print(s)

('학생2', 2, '안양', 'female')
('학생2', 2, '안양', 'female')
('학생2', 2, '안양', 'female')
('학생2', 2, '안양', 'female')
('학생3', 3, '경기도', 'female')
('학생4', 4, '춘천', 'female')
('학생5', 5, '대구', 'male')
('학생6', 6, '강릉', 'male')
('학생7', 7, '서울', 'male')
('학생8', 8, '경북', 'male')

In [10]:
sql = 'select * from student'
c = conn.cursor()
c.execute(sql)
for s in c.fetchall():
 print(s)

('학생2', 2, '안양', 'female')
('학생3', 3, '경기도', 'female')
('학생4', 4, '춘천', 'female')
('학생5', 5, '대구', 'male')

In [11]:
#### 실습 3-1
* student1 안에 데이터를 7개 넣고
* 첫번째 방법, fetchmany(10) 검색해보기
* 두번째 방법, fetchall() 검색해보기

SyntaxError: invalid syntax (<ipython-input-11-aca622130bef>, line 2)

In [12]:
conn = sqlite3.connect('student1.db')
conn

In [13]:
sql = """
 CREATE TABLE student1
 ( 
 name text,
 no integer,
 addr text,
 gender text
 )
"""

c = conn.cursor()
c.execute("DROP TABLE IF EXISTS student1")
c.execute(sql)
c.close()

In [19]:
sql = """
 INSERT INTO student1 VALUES
 (?, ?, ?, ?)
"""
c = conn.cursor() # 객체 생성
c.execute(sql, ('학생2', 2, '안양', 'female'))
data = [
 ('학생3', 3, '경기도', 'female'),
 ('학생4', 4, '춘천', 'female'),
 ('학생5', 5, '대구', 'male'),
 ('학생6', 6, '강릉', 'male'),
 ('학생7', 7, '서울', 'male'),
 ('학생8', 8, '경북', 'male'),
 ('학생9', 9, '삼척', 'male')
]

c.executemany(sql, data)
c.close()
conn.commit()

In [24]:
sql = 'select * from student1'
c = conn.cursor()
c.execute(sql)
# 하나의 데이터 확인
print( c.fetchone() )

('최종운', 100, 90, 80)

In [21]:
for s in c.fetchmany(10):
 print(s)

('학생2', 2, '안양', 'female')
('학생2', 2, '안양', 'female')
('학생2', 2, '안양', 'female')
('학생2', 2, '안양', 'female')
('학생3', 3, '경기도', 'female')
('학생4', 4, '춘천', 'female')
('학생5', 5, '대구', 'male')
('학생6', 6, '강릉', 'male')
('학생7', 7, '서울', 'male')
('학생8', 8, '경북', 'male')

In [23]:
sql = 'select * from student1'
c = conn.cursor()
c.execute(sql)
for s in c.fetchall():
 print(s)

('최종운', 100, 90, 80)
('학생2', 2, '안양', 'female')
('학생2', 2, '안양', 'female')
('학생2', 2, '안양', 'female')
('학생2', 2, '안양', 'female')
('학생3', 3, '경기도', 'female')
('학생4', 4, '춘천', 'female')
('학생5', 5, '대구', 'male')
('학생6', 6, '강릉', 'male')
('학생7', 7, '서울', 'male')
('학생8', 8, '경북', 'male')
('학생9', 9, '삼척', 'male')
('학생2', 2, '안양', 'female')
('학생3', 3, '경기도', 'female')
('학생4', 4, '춘천', 'female')
('학생5', 5, '대구', 'male')
('학생6', 6, '강릉', 'male')
('학생7', 7, '서울', 'male')
('학생8', 8, '경북', 'male')
('학생9', 9, '삼척', 'male')